In [17]:
import pandas as pd
import os

In [18]:
data_path = "../data/employeedata.csv"

if os.path.exists(data_path):
    df = pd.read_csv(data_path)
    print("üìÑ Current data loaded.")
else:
    print("‚ö†Ô∏è Data file not found.")

üìÑ Current data loaded.

In [19]:
print(df.columns)

Index(['experience', 'education', 'role', 'location', 'age', 'salary'], dtype='object')

In [20]:
# üîÅ Change these values to add more entries
new_employee = {
    "experience": 4,
    "education": "master",
    "role": "data scientist",
    "location": "tier-1",
    "age": 29,
    "salary": 78000
}

# Convert to DataFrame
new_df = pd.DataFrame([new_employee])
new_df

   experience education            role location  age  salary
0           4    master  data scientist   tier-1   29   78000

In [21]:
df_updated = pd.concat([df, new_df], ignore_index=True)
df_updated.tail()

   experience education                role location  age  salary
5           6       phd      data scientist   tier-1   32   90000
6           3  bachelor  frontend developer   tier-2   27   45000
7           5    master    senior developer   tier-1   31   75000
8           7       phd           tech lead   tier-1   35  100000
9           4    master      data scientist   tier-1   29   78000

In [22]:
df_updated.to_csv(data_path, index=False)
print("‚úÖ New data added to employeedata.csv")

‚úÖ New data added to employeedata.csv

In [23]:
new_employees = [
    {"experience": 2, "education": "bachelor", "role": "frontend developer", "location": "tier-2", "age": 24, "salary": 40000},
    {"experience": 6, "education": "phd", "role": "tech lead", "location": "tier-1", "age": 36, "salary": 105000}
]

new_df = pd.DataFrame(new_employees)